bench/results/server1/2/apiary-0.15.1/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.46ms    1.16ms  20.35ms   87.07%
    Req/Sec    23.30k     1.65k   28.40k    73.70%
  1346965 requests in 30.00s, 228.65MB read
Requests/sec:  44899.17
Transfer/sec:      7.62MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.48ms    1.20ms  19.51ms   87.21%
    Req/Sec    23.23k     1.71k   28.73k    73.71%
  1341432 requests in 30.00s, 227.71MB read
Requests/sec:  44714.81
Transfer/sec:      7.59MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.55ms    1.59ms  19.94ms   76.05%
    Req/Sec    23.46k     3.16k   34.50k    65.88%
  1333953 requests in 30.00s, 226.44MB read
Requests/sec:  44461.22
Transfer/sec:      7.55MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.45ms    1.60ms  17.97ms   83.65%
    Req/Sec    23.48k     1.86k   29.23k    72.07%
  1352082 requests in 30.00s, 229.52MB read
Requests/sec:  45069.61
Transfer/sec:      7.65MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.45ms    2.52ms  25.05ms   82.57%
    Req/Sec    23.67k     2.65k   32.33k    63.88%
  1354268 requests in 30.00s, 229.89MB read
Requests/sec:  45142.58
Transfer/sec:      7.66MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.50ms    1.26ms  22.82ms   84.69%
    Req/Sec    23.69k     3.13k   35.11k    65.46%
  1333267 requests in 30.00s, 226.33MB read
Requests/sec:  44442.82
Transfer/sec:      7.54MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.47ms    1.59ms  20.81ms   84.43%
    Req/Sec    23.38k     1.95k   30.08k    70.09%
  1346697 requests in 30.00s, 228.61MB read
Requests/sec:  44890.34
Transfer/sec:      7.62MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.47ms    1.21ms  19.81ms   78.01%
    Req/Sec    23.27k     2.04k   31.28k    71.39%
  1341566 requests in 30.00s, 227.74MB read
Requests/sec:  44719.10
Transfer/sec:      7.59MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.46ms    2.34ms  26.01ms   74.29%
    Req/Sec    23.62k     2.85k   34.92k    60.64%
  1351041 requests in 30.00s, 229.34MB read
Requests/sec:  45034.99
Transfer/sec:      7.64MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.54ms    1.63ms  30.19ms   85.66%
    Req/Sec    23.52k     3.05k   34.00k    65.22%
  1333479 requests in 30.00s, 226.36MB read
Requests/sec:  44449.45
Transfer/sec:      7.55MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.15.1
bench:        PARAM
bench mode:   30s * 10
average:      44782.41
stdev:        266.50
=================== oneline ===================
7.8.2,apiary-0.15.1,PARAM,30s,10,44782.41,266.50